РП/src/AccountingRegisters/Международный/Международный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Международный</name>
  <chartOfAccounts>ChartOfAccounts.Международный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Международный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>СуммаПредставления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Международный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонПроводки</name>
    <type>
      <types>CatalogRef.ШаблоныПроводокДляМеждународногоУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПроводки</name>
    <type>
      <types>EnumRef.ТипыПроводокМеждународныйУчет</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

РП/src/Documents/ОперацияМеждународный/ОперацияМеждународный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОперацияМеждународный</name>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccountingRegister.Международный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводитьПериодПоСтрокам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаполнениеДвижений</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ВнутреннееПотреблениеТоваров</types>
        <types>DocumentRef.ПодготовкаКПередачеНМА</types>
        <types>DocumentRef.СписаниеОС</types>
        <types>DocumentRef.АмортизацияОСМеждународныйУчет</types>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.ПередачаДавальцу</types>
        <types>DocumentRef.ПеремещениеМатериаловВПроизводстве</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.ВозвратТоваровОтКлиента</types>
        <types>DocumentRef.ПередачаОСАрендатору</types>
        <types>DocumentRef.ПереводОсновныхСредствИнвестиционногоИмуществаМеждународныйУчет</types>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
        <types>DocumentRef.ОперацияПоПлатежнойКарте</types>
        <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
        <types>DocumentRef.ПоступлениеУслугПоЛизингу</types>
        <types>DocumentRef.ПерерасчетПропорциональногоНДСпоТоварамИОС</types>
        <types>DocumentRef.ОтчетКомиссионера</types>
        <types>DocumentRef.ОтчетДавальцу</types>
        <types>DocumentRef.ПринятиеКУчетуОС</types>
        <types>DocumentRef.АмортизацияНМА</types>
        <types>DocumentRef.ВнесениеДенежныхСредствВКассуККМ</types>
        <types>DocumentRef.ПереоценкаВалютныхСредств</types>
        <types>DocumentRef.ПоступлениеСырьяОтДавальца</types>
        <types>DocumentRef.НачислениеОценочныхОбязательствПоОтпускам</types>
        <types>DocumentRef.ВозвратТоваровПоставщику</types>
        <types>DocumentRef.РаспределениеПроизводственныхЗатрат</types>
        <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ОперацияБух</types>
        <types>DocumentRef.РегламентнаяОперацияМеждународныйУчет</types>
        <types>DocumentRef.АмортизацияНМАМеждународныйУчет</types>
        <types>DocumentRef.ВводОстатков</types>
        <types>DocumentRef.ПринятиеКУчетуОСМеждународныйУчет</types>
        <types>DocumentRef.ПрочиеДоходыРасходы</types>
        <types>DocumentRef.ИзменениеПараметровНМАМеждународныйУчет</types>
        <types>DocumentRef.ОперацияМеждународный</types>
        <types>DocumentRef.ВводОстатковОСМеждународныйУчет</types>
        <types>DocumentRef.ВводОстатковНМАМеждународныйУчет</types>
        <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
        <types>DocumentRef.СписаниеНМАМеждународныйУчет</types>
        <types>DocumentRef.ПеремещениеНМАМеждународныйУчет</types>
        <types>DocumentRef.РаспределениеРасходовБудущихПериодов</types>
        <types>DocumentRef.МодернизацияОС</types>
        <types>DocumentRef.ОтчетКомитенту</types>
        <types>DocumentRef.СписаниеНедостачТоваров</types>
        <types>DocumentRef.РаспределениеПрочихЗатрат</types>
        <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
        <types>DocumentRef.ПеремещениеТоваров</types>
        <types>DocumentRef.ВозвратСырьяДавальцу</types>
        <types>DocumentRef.КорректировкаРеализации</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.АмортизацияОС</types>
        <types>DocumentRef.ПодготовкаКПередачеОС</types>
        <types>DocumentRef.ПоступлениеАрендованныхОС</types>
        <types>DocumentRef.ОтражениеЗарплатыВФинансовомУчете</types>
        <types>DocumentRef.ПереоценкаНМА</types>
        <types>DocumentRef.ПередачаСырьяПереработчику</types>
        <types>DocumentRef.ОтчетБанкаПоОперациямЭквайринга</types>
        <types>DocumentRef.ВводОстатковВнеоборотныхАктивов</types>
        <types>DocumentRef.КорректировкаНазначенияТоваров</types>
        <types>DocumentRef.ПересортицаТоваров</types>
        <types>DocumentRef.ВыбытиеДенежныхДокументов</types>
        <types>DocumentRef.ПоступлениеДенежныхДокументов</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
        <types>DocumentRef.НачислениеДивидендов</types>
        <types>DocumentRef.КорректировкаПоступления</types>
        <types>DocumentRef.ОтчетКомитентуОСписании</types>
        <types>DocumentRef.ОтчетПереработчика</types>
        <types>DocumentRef.ВыкупВозвратнойТарыКлиентом</types>
        <types>DocumentRef.ПереоценкаОС</types>
        <types>DocumentRef.ПеремещениеОСМеждународныйУчет</types>
        <types>DocumentRef.ПоступлениеУслугПрочихАктивов</types>
        <types>DocumentRef.АннулированиеПодарочныхСертификатов</types>
        <types>DocumentRef.АктВыполненныхРабот</types>
        <types>DocumentRef.ОтчетОРозничныхПродажах</types>
        <types>DocumentRef.ИнвентаризацияНаличныхДенежныхСредств</types>
        <types>DocumentRef.ИзменениеПараметровОС</types>
        <types>DocumentRef.ОприходованиеИзлишковТоваров</types>
        <types>DocumentRef.ВозвратСырьяОтПереработчика</types>
        <types>DocumentRef.СписаниеЗадолженности</types>
        <types>DocumentRef.ВыпускПродукции</types>
        <types>DocumentRef.ВозвратТоваровМеждуОрганизациями</types>
        <types>DocumentRef.СборкаТоваров</types>
        <types>DocumentRef.СписаниеОСМеждународныйУчет</types>
        <types>DocumentRef.ОтчетКомиссионераОСписании</types>
        <types>DocumentRef.ВозвратМатериаловИзПроизводства</types>
        <types>DocumentRef.ПринятиеКУчетуНМАМеждународныйУчет</types>
        <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
        <types>DocumentRef.ВозвратОСОтАрендатора</types>
        <types>DocumentRef.ВыкупВозвратнойТарыУПоставщика</types>
        <types>DocumentRef.РегламентнаяОперация</types>
        <types>DocumentRef.ВзаимозачетЗадолженности</types>
        <types>DocumentRef.ДепонированиеЗарплаты</types>
        <types>DocumentRef.ОтражениеРасхожденийПриИнкассацииДенежныхСредств</types>
        <types>DocumentRef.РасчетСебестоимостиТоваров</types>
        <types>DocumentRef.ПрочееОприходованиеТоваров</types>
        <types>DocumentRef.НачисленияКредитовИДепозитов</types>
        <types>DocumentRef.РеализацияПодарочныхСертификатов</types>
        <types>DocumentRef.ИзменениеПараметровОСМеждународныйУчет</types>
        <types>DocumentRef.ПеремещениеОС</types>
        <types>DocumentRef.ВозвратПодарочныхСертификатов</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПередачаМатериаловВПроизводство</types>
        <types>DocumentRef.ПринятиеКУчетуНМА</types>
        <types>DocumentRef.ПорчаТоваров</types>
        <types>DocumentRef.ПоступлениеОтПереработчика</types>
        <types>DocumentRef.СписаниеНМА</types>
        <types>DocumentRef.ВыбытиеАрендованныхОС</types>
        <types>DocumentRef.ПоступлениеПредметовЛизинга</types>
        <types>DocumentRef.ВыемкаДенежныхСредствИзКассыККМ</types>
        <types>DocumentRef.КорректировкаНалоговогоНазначенияКапитальныхИнвестиций</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

РП/src/AccountingRegisters/Международный/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборСчетПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Счет", ОтборСчет, ЗначениеЗаполнено(ОтборСчет), ВидСравненияКомпоновкиДанных.ВИерархии);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Организация", ОтборОрганизация, ЗначениеЗаполнено(ОтборОрганизация));

КонецПроцедуры

&НаКлиенте
Процедура ОтборРегистраторПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Регистратор", ОтборРегистратор, ЗначениеЗаполнено(ОтборРегистратор));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ТипЗнч(Элемент.ТекущиеДанные.Регистратор) = Тип("ДокументСсылка.ОперацияМеждународный") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ОткрытьФорму("Документ.ОперацияМеждународный.ФормаОбъекта",
					Новый Структура("ПараметрТекущаяСтрока,Ключ", Элемент.ТекущиеДанные.НомерСтроки,Элемент.ТекущиеДанные.Регистратор));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПереключитьАктивностьПроводок(Команда)
	
	ТекДокумент = ПолучитьДокумент();
	
	Если ТекДокумент <> Неопределено Тогда
		
		ПереключитьАктивностьПроводокСервер(ТекДокумент);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПереключитьАктивностьПроводокСервер(Документ)
	
	ПереключитьАктивностьПроводокМФУ(Документ);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьДокумент()
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		ПоказатьПредупреждение(,НСтр("ru='Не выбран документ';uk='Не вибраний документ'"));
		Возврат Неопределено;
	КонецЕсли;
	
	ТекДокумент = ТекДанные.Регистратор;
	Если НЕ ЗначениеЗаполнено(ТекДокумент) Тогда
		ПоказатьПредупреждение(,НСтр("ru='Не выбран документ';uk='Не вибраний документ'"));
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ТекДокумент;
	
КонецФункции

&НаСервере
Процедура ПереключитьАктивностьПроводокМФУ(Документ)
	
	Если Документ.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;

	ПроводкиДокумента = РегистрыБухгалтерии.Международный.СоздатьНаборЗаписей();
	ПроводкиДокумента.Отбор.Регистратор.Установить(Документ);
	ПроводкиДокумента.Прочитать();

	КоличествоПроводок = ПроводкиДокумента.Количество();
	Если НЕ (КоличествоПроводок = 0) Тогда
		
		// Определяем текущую активность проводок по первой проводке
		ТекущаяАктивностьПроводок = ПроводкиДокумента[0].Активность;

		// Инвертируем текущую активность проводок
		ПроводкиДокумента.УстановитьАктивность(НЕ ТекущаяАктивностьПроводок);
		ПроводкиДокумента.Записать();

	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
